%二维PNG比例导引
%参考https://wenku.baidu.com/view/a8c025359e31433238689371.html?sxts=1570696048507

clear all;
clc;

x2(1)=5000; y2(1)=10000;
x1(1)=0; y1(1)=0;
q(1)=1;
r(1)=1.5;

for k = 2:20000
    x2(k) = x2(k-1)-173*0.01;
    y2(k) = y2(k-1)+100*0.01;
    q(k)=acos((x2(k-1) - x1(k-1))/((x2(k-1) - x1(k-1))^2+(y2(k-1)-y1(k-1))^2)^0.5);
    r(k) = 1.6*(q(k)-q(k-1))+r(k-1);
    x1(k) = x1(k-1) + 1000*cos(r(k))*0.01;
    y1(k) = y1(k-1) + 1000*sin(r(k))*0.01;
    if((x2(k-1)-x1(k-1))^2 + (y2(k-1)-y1(k-1))^2)^0.5 < 20
        break
    end
end
plot(x1,y1,'r',x2,y2,'b')

