clear;
clc;
P=[54, 67
54, 62
37, 84
41, 94
 2, 99
 7, 64
25, 62
22, 60
18, 54
 4, 50
13, 40
18, 40
24, 42
25, 38
44, 35
41, 26
45, 21
58, 35
62, 32
82,  7
91, 38
83, 46
71, 44
64, 60
68, 58
83, 69
87, 76
74, 78
71, 71
58, 69];%******oliver30数据，最小值是423.741
N=30;
flag2=0;flag1=0;
for i=1:N
    for j=1:N
       D(i,j)=sqrt((P(i,1)-P(j,1))^2+(P(i,2)-P(j,2))^2);
    end
end
M=max(max(D));
D1=D;
for i=1:N
    for j=1:N
        if (i<=j)
            D1(i,j)=10*M;
        end
    end
end

[ plan,y ] = minAssign( D1+0.000001*rand(N,N));